In [1]:
import pandas as pd

In [6]:
df = pd.DataFrame({
    "Apple":['Likes', 'Dislikes'],
    "Linux":['Likes', 'Likes'],
    "Windows":['Likes', 'Dislikes']
}, index=['Harshit', 'Your typical open source coder'])

In [7]:
df

                                   Apple  Linux   Windows
Harshit                            Likes  Likes     Likes
Your typical open source coder  Dislikes  Likes  Dislikes

In [8]:
df = pd.DataFrame({
    "Apple":['Likes', 'Dislikes'],
    "Linux":['Likes', 'Likes'],
    "Windows":['Likes', 'Dislikes']
})

In [9]:
df

      Apple  Linux   Windows
0     Likes  Likes     Likes
1  Dislikes  Likes  Dislikes

In [10]:
pd.Series(['This', 'is', 'a', 'series'])

0      This
1        is
2         a
3    series
dtype: object

In [12]:
pd.Series(['This', 'is', 'a', 'series'], index=['Naming', 'Rows', 'Same', 'As Dataframe'], name='Gets an overall name, no column name')

Naming            This
Rows                is
Same                 a
As Dataframe    series
Name: Gets an overall name, no column name, dtype: object

In [13]:
df = pd.read_csv('../Datasets/titanic/train.csv')

In [14]:
df.shape

(891, 12)

In [15]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [16]:
df_new = pd.read_csv('../Datasets/titanic/train.csv', index_col=0)

In [17]:
df_new.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S